//
// Created by ivasp on 1/13/2023.
//Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви),
//како и елементите на матрицата со димензии M x N (цели броеви).
//Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:
//Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
//Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
//Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0

#include <stdio.h>

int main(){
    int x;
    scanf("%d",&x);

    int m,n;
    scanf("%d%d",&m,&n);

    int a[100][100];
    for(int i=0;i<m;i++){
        for(int j=0;j<n;j++){
            scanf("%d",&a[i][j]);
        }
    }

    for(int i=0;i<m;i++){
        int zbir=0;
        for(int j=0;j<n;j++){
            zbir+=a[i][j];
        }

        if(zbir>x){
            for(int j=0;j<n;j++){
                a[i][j]=1;
            }
        }
        else if(zbir<x){
            for(int j=0;j<n;j++){
                a[i][j]=-1;
            }
        }
        else{
            for(int j=0;j<n;j++){
                a[i][j]=0;
            }
        }
    }

    for(int i=0;i<m;i++){
        for(int j=0;j<n;j++){
            printf("%d ",a[i][j]);
        }
        printf("\n");
    }

    return 0;
}