//
// Created by ivasp on 1/13/2023.
//Да се напише програма во која се вчитува матрица од цели броеви A со N редици и N * 2 колони (N не е поголемо од 50).
//Програмата треба да ја трансформира вчитаната матрица во нова матрица B,
//така што сите елементи десно од N-тата колона ќе ги префрли под N-тата редица,
//односно од матрица со димензија N редици и 2 * N колони ќе се добие матрица со 2 * N редици x N колони.

#include <stdio.h>

int main(){
    int n;
    scanf("%d%d",&n);

    int a[100][100];
    for(int i=0;i<n;i++){
        for(int j=0;j<n*2;j++){
            scanf("%d",&a[i][j]);
        }
    }

    int b[100][100];
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            b[i][j]=a[i][j];
        }
    }

    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            b[i+n][j]=a[i][j+n];
        }
    }

    for(int i=0;i<n*2;i++){
        for(int j=0;j<n;j++){
            printf("%d ",b[i][j]);
        }
        printf("\n");
    }

    return 0;
}