//
// Created by ivasp on 1/13/2023.
//За еден природен број а велиме дека е порамнување на друг природен број b ако и само ако
//цифрите еднакви на 9 во бројот b се заменети со цифрата 7 во бројот а.
//Пример. Бројот 734775 е порамнување на бројот 934795.
//Од стандарден влез се внесуваат непознат број на цели броеви (не повеќе од 100),
//се додека не се внесе нешто што не може да се интерпретира како цел број.
//Ваша задача е да ги отпечатите најмалите 5 од порамнувањата на сите внесени броеви, по редослед од најмалиот кон најголемиот.
//Забелешка: Доколку се внесат помалку од 5 броеви, тогаш печатите толку броеви колку што се соодветно внесени.
//Наоѓањето на порамнувањето на даден број треба да се реализира во посебна рекурзивна функција poramnet(int a).
//Пример. За броевите: 9592, 69403, 100007, 6, 987, 6977, 33439,
//треба да се најдат нивните порамнувања ( тоа се: 7572, 67403, 100007, 6, 787, 6777 и 33437, соодветно),
//и да се отпечатат најмалите 5 од нив по овој редослед: 6 787 6777 7572 33437.
//ЗАБРАНЕТО е користење на глобални променливи.

#include <stdio.h>

int poramnet(int a){
    if(a==0) return 0;
    else{
        if((a%10)==9) return 7 + 10*poramnet(a/10);
        else return a%10 + 10* poramnet(a/10);
    }
}

void swap(int *x,int *y){
    int tmp=*x;
    *x=*y;
    *y=tmp;
}

void sortNiza(int niza[],int n){
    int i,j;
    for(i=0;i<n;i++){
        for(j=0;j<n-1-i;j++){
            if(niza[j]>niza[j+1]){
                swap(&niza[j],&niza[j+1]);
            }
        }
    }
}

int main(){
    int broj;
    int niza[100];
    int i=0;
    while(scanf("%d",&broj)){
        niza[i]=poramnet(broj);
        ++i;
    }

    sortNiza(niza,i);

    for(int j=0;j<i;j++){
        if(j==5) break;
        printf("%d ",niza[j]);
    }

    return 0;
}