//
// Created by ivasp on 1/18/2023.
//Од стаднарден влез се читаат N низи од знаци (стрингови) не подолги од 80 знаци.
//На почетокот на програмата се читаат два цели броеви:
//N - бројот на низи од знаци кои ќе се читаат и
//X - поместување.
//Секоја од вчитаните низи од знаци треба да се трансформира на тој начин што секоја од малите и големите букви (a-z, A-Z)
//се заменува со истата буква поместена X места понапред во азбуката (a-z).
//Ако се надмине опсегот на буквите во азбуката, се продолжува циклично од почетокот на азбуката.
//Трансформираната низа да се отпечати на СИ.
//Трансформацијата да се имплементира со посебна рекурзивна функција.
//Пример:
//Welcome -> трансформирано со поместување 5 -> Bjqhtrj

#include <stdio.h>
#include <string.h>
#include <ctype.h>

void clearString(char *a){
    a[strlen(a)-1]='\0';
}

void funkcija(char *a,int x){
    if(*a=='\0') return;
    else{
        if(islower(*a)){
            if((*a+x)>'z'){
                *a=(*a+x)-26;
            }
            else *a+=x;
        }

        if(isupper(*a)){
            if((*a+x)>'Z'){
                *a=(*a+x)-26;
            }
            else *a+=x;
        }
        funkcija(a+1,x);
    }
}

int main(){
    int n,x;
    scanf("%d%d",&n,&x);

    char niza[100];
    for(int i=0;i<n;i++){
        fgets(niza,100,stdin);
        clearString(niza);
        funkcija(niza,x);
        printf("%s\n",niza);
    }

    return 0;
}