//
// Created by ivasp on 1/13/2023.
//Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата).
//Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).
//Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100).
//Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.
//Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез.
//Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот.
//Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.

#include <stdio.h>

int main(){
    int m,n;
    scanf("%d%d",&m,&n);

    int a[100][100];
    for(int i=0;i<m;i++){
        for(int j=0;j<n;j++){
            scanf("%d",&a[i][j]);
        }
    }

    int x,y;
    scanf("%d%d",&x,&y);

    int k1=0,k2=0,k3=0,k4=0;
    for(int i=0;i<m;i++){
        for(int j=0;j<n;j++){
            if(i>=x && j>=y) k1+=a[i][j];
            else if(i>=x && j<y) k2+=a[i][j];
            else if(i<x && j<y) k3+=a[i][j];
            else k4+=a[i][j];
        }
    }
    printf("%d %d %d %d",k4,k3,k2,k1);

    return 0;
}