//
// Created by ivasp on 1/20/2023.
//Од тастатура се внесува цел број M, а потоа M низи од цели броеви.
//За секоја низа прво се внесува бројот на елементи во низата N (N<=100), а потоа и елементите на низата.
//Секоја од внесените низи треба да се трансформира според следново правило:
// - Ако првиот елемент од низата е позитивен број, тоа значи сите елементи од низата (вклучувајќи го и првиот)
//да се поместат за онолку места во десно, колку што е вредноста на елементот,
//празнините што ќе настанат во низата да се пополнат со елементи со вредност нула.
// - Ако првиот елемент од низата е негативен број, тоа значи сите елементи од низата (вклучувајќи го и првиот)
//да се поместат за онолку места во лево, колку што е вредноста на елементот,
//празнините што ќе настанат во низата да се пополнат со елементи со вредност нула.
//При поместување на елементите, бројот на елементите во низата останува непроменет.
//На крајот да се испечатат трансформираните низи како и тоа колку од влезните низи останале празни,
//односно по трансформацијата имаат само елементи со вредност нула.

#include <stdio.h>
#include <math.h>

int allZeros(int *a,int n){
    for(int i=0;i<n;i++){
        if(a[i]!=0) return 0;
    }
    return 1;
}

void transform(int *a,int n){
    int x=a[0];

    if(fabs(x)>n){
        for(int i=0;i<n;i++){
            a[i]=0;
        }
        return;
    }

    if(x>0){
        for(int i=n-1;i>=0;i--){
            a[i]=a[i-x];
        }

        for(int i=0;i<x;i++){
            a[i]=0;
        }
    }
    else{
        for(int i=0;i<n;i++){
            a[i]=a[i-x];
        }

        for(int i=n-1;i>=n+x;i--){
            a[i]=0;
        }
    }
}

int main(){
    int m;
    scanf("%d",&m);
    int counter=0;
    for(int i=0;i<m;i++){
        int n,niza[100];
        scanf("%d",&n);
        for(int j=0;j<n;j++){
            scanf("%d",&niza[j]);
        }

        transform(niza,n);

        for(int j=0;j<n;j++){
            printf("%d ",niza[j]);
        }
        printf("\n");

        if(allZeros(niza,n)){
            ++counter;
        }
    }

    printf("%d",counter);

    return 0;
}