//
// Created by ivasp on 11/24/2022.
//Во играта Бинго се извлекуваат непознат број броеви со вредности помеѓу 1 и 90
//Секогаш се извлекуваат повеќе од 8 броја
//Претпоставете дека внесувањето престанува кога ќе се внесе број кој не е во опсегот вредности
//Освен главната добивка, играчите играат и на џокер број, кој се формира на следниот начин:
//се слепуваат помалку значајните цифри од првите 7 извлечени броја, и на тој број се додаваат сите следни внесени броеви
//Ваша задача е да го отпечатите така добиениот џокер број

#include <stdio.h>

int main(){
    int n;
    int br=0;
    int joker=0;
    for(int i=0;;i++){
        scanf("%d",&n);
        if(n<1 || n>90) break;
        br++;

        if(i<7) joker=10*joker+(n%10);
        else joker+=n;
    }
    if(br<=8) printf("Nema dovolno broevi");
    else printf("%d", joker);

    return 0;
}