//
// Created by ivasp on 11/24/2022.
//Од тастатура се внесуваат два едноцифрени броја C1 и C2 (1 <= C1, C2 <= 9).
// Потоа се внесува природен број N, кој означува колку броеви ќе се внесат во продолжение.
// Потоа се внесуваат N-те природни броеви.
// За секој од внесените броеви програмата треба да го испечати бројот кај кој цифрата C1
// од внесениот број е заменетa со цифра C2, како и неговиот следбеник.
//
//Забелешка: За освојување на 80% од поените може да претпоставите дека внесените броеви не завршуваат на нула.
//5 6
//7
//125
//521
//1556
//5015
//950
//555
//5
//output:
//126 127
//621 622
//1666 1667
//6016 6017
//960 961
//666 667
//6 7

#include <stdio.h>

int main(){
    int c1,c2;
    scanf("%d %d", &c1,&c2);

    int n;
    scanf("%d",&n);

    int broj;
    for(int i=0;i<n;i++){
        scanf("%d",&broj);
        int temp=broj;
        int koeficient=1;
        int nov=0;
        while(temp){
            int cifra=temp%10;
            if(cifra==c1) nov += koeficient * c2;
            else nov+=koeficient*cifra;
            koeficient*=10;
            temp/=10;
        }
        printf("%d %d\n", nov, nov+1);
    }

    return 0;
}


//Обиколка на геометриска слика се пресметува како збир од должините од сите нејзини страни.
// Во оваа задача, на почеток како влез се внесува една буква Т или М. Во зависност од тоа:
//Ако е внесена буквата Т, тоа означува дека внесуваме податоци за триаголник и се внесуваат 3 различни цели броеви (должини на неговите страни)
//Ако е внесена буквата М, тоа означува дека внесуваме податоци за многуаголник и се внесува прво број N - број на страните на многуаголникот,
// а потоа N различни цели броеви (должини на неговите страни).
//Ваша задача е на излез да ја испечатите обиколката на внесената геометриска слика.
//
//Забелешка: Секогаш на влез ќе има валидни податоци.
//Влез: Т 6 7 9
//Излез: 22
//Пример 2:
//Влез:М    5     3 3 3 4 4
//Излез: 17

/*#include <stdio.h>

int main(){
    char bukva;
    scanf("%c", &bukva);
    int n;
    if(bukva=='T') n=3;
    else scanf("%d", &n);

    int strana, suma=0;
    for(int i=0;i<n;i++){
        scanf("%d", &strana);
        suma+=strana;
    }
    printf("%d", suma);
    return 0;
}*/