//
// Created by ivasp on 11/24/2022.
//Од тастатура се чита позитивен цел број X(>1).
// Да се најдат сите комбинации од парови ненегативни броеви чиј збир е бројот X.
// Притоа, за секој пар треба да важи дека првиот број во парот е прост, а вториот е парен број.
// При печатењето, паровите се печатат во растечки редослед, според првиот елемент од парот.
//Забелешка: Бројот 1 не е ниту прост, ниту сложен број.

#include <stdio.h>

int brDeliteli(int x){
    int br=0;
    for(int i=1;i<=x;i++)
        if(x%i==0) br++;
    return br;
}

int main(){
    int x;
    scanf("%d", &x);
    if(x<=1) return 0;

    for(int i=2;i<=x;i++){
        if(brDeliteli(i)==2){
            if((x-i)%2==0)
                printf("%d + %d = %d\n", i,x-i,x);
        }
        else continue;
    }
    return 0;
}